<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | Email для получения новых заявок
    |--------------------------------------------------------------------------
    */

    'orders_email' => env('ORDERS_EMAIL'),

    /*
    |--------------------------------------------------------------------------
    | Мессенджеры
    |--------------------------------------------------------------------------
    */

    'messengers' => [
        [
            'key' => 'max',
            'label' => 'MAX',
            'description' => 'Написать в MAX',
            'url' => env('CONTACT_MAX_URL'),
        ],
        [
            'key' => 'vk',
            'label' => 'VK Мессенджер',
            'description' => 'Написать ВКонтакте',
            'url' => env('CONTACT_VK_MESSAGE_URL'),
        ],
         [
            'key' => 'telegram',
            'label' => 'Телеграм',
            'description' => 'Написать в Телеграм',
            'url' => env('CONTACT_TELEGRAM_URL'),
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Социальные сети и медиаплощадки
    |--------------------------------------------------------------------------
    */

    'socials' => [
        [
            'key' => 'vk',
            'label' => 'ВКонтакте',
            'description' => 'Наша страница ВКонтакте',
            'url' => env('CONTACT_VK_URL'),
        ],
        // [
        //     'key' => 'ok',
        //     'label' => 'Одноклассники',
        //     'description' => 'Наша страница в Одноклассниках',
        //     'url' => env('CONTACT_OK_URL'),
        // ],
        // [
        //     'key' => 'dzen',
        //     'label' => 'Дзен',
        //     'description' => 'Читайте наши публикации',
        //     'url' => env('CONTACT_DZEN_URL'),
        // ],
        [
            'key' => 'rutube',
            'label' => 'Rutube',
            'description' => 'Смотрите наши видео',
            'url' => env('CONTACT_RUTUBE_URL'),
        ],

        //  [
        //     'key' => 'max',
        //     'label' => 'MAX',
        //     'description' => 'Наша группа в MAX',
        //     'url' => env('CONTACT_MAX_URL'),
        // ],
    ],
];